Типы интеграции с партнерами

## Интеграция с операторами программ лояльности

Платформа Cardsmobile поддерживает следующие типы интеграции с партнерами, являющимися операторами программ лояльности и/или провайдерами подарочных сертификатов:

1. *Онлайн-интеграция*, заключающаяся в подключении и интерактивном взаимодействии платформы Cardsmobile и информационной системы партнера, предназначенной для управления программами лояльности (выпуск и обслуживание карт лояльности, подарочных сертификатов (карт), учет транзакций клиентов в точках обслуживания, начисление и списание бонусных баллов, и т. п.).  Онлайн-интеграция Cardsmobile и партнера может быть реализована:
   - с использованием соответствующего Online API Cardsmobile;
   - с использованием API, предоставленного партнером;
2. *Офлайн-интеграция*, заключающаяся в обмене файлами между Cardsmobile и информационной системой партнера, предназначенной для управления программами лояльности. В этом режиме партнер обеспечивает периодическую выгрузку реестров, содержащих сведения о картах лояльности и/или подарочных сертификатах, а Cardsmobile – реестров карт и/или подарочных сертификатов, выпущенных в приложении «Кошелёк».

!!! "Офлайн-интеграция предоставляет партнеру меньше возможностей  по взаимодействию с клиентом программы лояльности через приложение «Кошелёк»."

При необходимости имеется возможность организовать смешанный вариант интеграции, при котором часть информации, необходимой для выпуска и обслуживания виртуальных копий карт лояльности в приложении «Кошелёк», передается в режиме онлайн, с использованием API, а вторая часть – в виде обмена файлами (например, реестр номеров карт лояльности, зарезервированных партнером для выпуска клиентам программы лояльности непосредственно в приложении).

О реализации способов интеграции см. следующие материалы:

- ****[**Cardsmobile Loyalty Online API**](https://developers.cardsmobile.ru/loyalty-api/about).
- ****[**Cardsmobile Loyalty Offline Service**](https://developers.cardsmobile.ru/offline-loyalty/about).
- ****[**Cardsmobile Gift Cards Offline Service**](https://developers.cardsmobile.ru/cardsmobile-gift-cards-offline-service/about).

Для улучшения качества обслуживания виртуальных копий карт лояльности, выпущенных в приложении «Кошелёк», платформа Cardsmobile предоставляет также дополнительные API:

- [**Cardsmobile TOTP Service**](https://developers.cardsmobile.ru/totp-service/about).
- [**Cardsmobile Place Info API**](https://developers.cardsmobile.ru/place-info/about).
- [**Cardsmobile Check-in API**](https://developers.cardsmobile.ru/check-in/about).
- [**Cardsmobile Push API**](https://developers.cardsmobile.ru/push-api/about).
- [**Cardsmobile Promo API**](https://developers.cardsmobile.ru/promo/about).
- [**Кошелёк Pay API**](https://developers.cardsmobile.ru/pay-api/about).

## Интеграция с эмитентами банковских продуктов

Интеграция с партнерами, являющимися эмитентами банковских продуктов (платежных банковских карт), осуществляется только в режиме онлайн с использованием специального Online API.

О реализации интеграции с эмитентом банковских продуктов см.:

- [**Cardsmobile Digital Product Delivery API**](https://developers.cardsmobile.ru/cardsmobile-delivery-api/about).
